
/*
Тема:  Основні типи та оператори мови програмування Java

Мета:  Ознайомлення з основними типами та операторами в Java. Здобуття навичок у використанні типів та операторів в Java.

Завдання

    Визначити C2 як остачу від ділення номера залікової книжки студента на 2, C3 як остачу від ділення номера залікової книжки студента на 3, C5 як остачу від ділення номера залікової книжки студента на 5, C7 як остачу від ділення номера залікової книжки студента на 7.
    В залежності від C2 визначити операцію O1:
    C2 	Операція О1
    0 	+
    1 	-
    Визначити константу C, яка дорівнює значенню C 3.
    В залежності від C 5 визначити операцію O2:
    C5 	Операція O2
    0 	*
    1 	/
    2 	%
    3 	+
    4 	-
    В залежності від C7 визначити тип індексів i та j:
    C7 	Тип індексів i та j
    0 	byte
    1 	short
    2 	int
    3 	long
    4 	char
    5 	float
    6 	double
    Створити клас, який складається з виконавчого методу, що виконує обчислення значення функції із зазначеним типом індексів (п.5), операціями (п.2 та п.4) та константою (п.3). Результатом виконання дії є єдине значення дійсного типу. Необхідно обробити всі виключні ситуації, що можуть виникнути під час виконання програмного коду. Всі змінні повинні бути описані та значення їх задані у виконавчому методі.

Лаб 1
Виконав студент групи ІО-04 Возниця Дмитро 0403
Варіант:
C2=1(-)
C3=1
C5=3(+)
C7=4(char)
 */


public class Main {
    public static void main(String[] args) {
        char c=403%3;
        char n=9,m=8,a=3,b=4;
        double result=0;
        if (a <= 0&&m >= 0){
            System.out.println("Incorrect input");}
        else
        {
            for (char  i = a; i <= n; i++) {
                    if (i==c){
                        System.out.println("Division by zero");
                        result=0;
                        break;
                    }
                    else{
                        for (char j = b; j <= m; j++) {
                        result += (float) (i + j) / (i - c);
                    }
                }
            }
        }
        System.out.printf("Result: %.3f",result);
    }
}